app/views/agenda/index.html.erb

      <th>Horario</th>
      <% Agendamento::DIAS.each do |key, dia_semana| %>
---
SELECT "agendamentos".* FROM "agendamentos"