app/controllers/agenda_controller.rb

SELECT "agendamentos".* FROM "agendamentos"  ORDER BY "agendamentos"."horario" ASC, "agendamentos"."dia_semana" ASC
---
  def index
  	@agendamentos = Agendamento.order( :horario, :dia_semana )

UPDATE "agendamentos" SET "user_id" = $1, "updated_at" = $2 WHERE "agendamentos"."id" = $3  [["user_id", 1], ["updated_at", "2015-04-15 18:50:20.838066"], ["id", 145]]
---
  def agendar
  	@agendamento.update user: current_user

UPDATE "agendamentos" SET "user_id" = $1, "updated_at" = $2 WHERE "agendamentos"."id" = $3  [["user_id", nil], ["updated_at", "2015-04-15 18:52:32.427632"], ["id", 145]]
---
  def desmarcar
    @agendamento.update user: nil

SELECT  "agendamentos".* FROM "agendamentos" WHERE "agendamentos"."id" = $1 LIMIT 1  [["id", 145]]
---
  	def set_agendamento
  		@agendamento = Agendamento.find params[:id]